package Homeworks.HW_Lesson4;

/*Є N клієнтів, яким компанія-виробник має доставити товар. Скільки є можливих маршрутів доставлення товару з урахуванням того, що товар доставлятиме одна машина?
Використовуючи IntelliJ IDEA, створіть клас Delivery. Напишіть програму, яка розраховуватиме та виводитиме на екран кількість можливих варіантів доставлення
товару. Для розв'язку задачі, використовуйте факторіал N!, що розраховується рекурсією. Поясніть, чому не рекомендується використовувати рекурсію для розрахунку
факторіала. Вкажіть слабкі місця цього підходу.*/

/*Відповідь про слабкі місця: рекурсивний підхід для обчислення факторіала є простим та зрозумілим, проте він може бути неефективним для великих значень N.
Оскільки рекурсія використовує стековий механізм, великі значення N можуть призвести до переповнення стеку та помилки "StackOverflowError".*/

public class HW12_Delivery {
    public static void main(String[] args) {
        int N = 5;
        int routes = factorial(N);
        System.out.println("Кількість можливих маршрутів доставки: " + routes);
    }

    public static int factorial(int n) {
        if (n == 1) {
            return 1;
        } else {
            return n * factorial(n - 1);
        }
    }
}
