package Homeworks.HW_Lesson1;

//Використовуючи IntelliJ IDEA, створіть проект. Створіть три рядкові змінні та надайте їм значення:
//"Мій рядок 1"
//"Мій рядок 2"
//"Мій рядок 3"
//Виведіть значення кожної змінної на екрані. Які відмінності ви побачили. Зробіть висновки.

public class HW2 {
    public static void main(String[] args) {
        String myString1 = "Мій рядок 1";
        String myString2 = "Мій рядок 2";
        String myString3 = "Мій рядок 3";

        System.out.println(myString1);
        System.out.println(myString2);
        System.out.println(myString3);
    }
}

//Відмінностей, крім вказання в строці номеру рядку (1,2,3), помічено не було. Якщо брати загалом,
//то однією з відмінностей між рядковими змінними полягає в тому, що
//вони можуть містити різну кількість символів. Також, відмінною особливістю
//рядкових змінних є те, що вони можуть містити будь-які символи, включаючи
//літери, цифри, пробіли та спеціальні символи.