package Homeworks.HW_Lesson1;

/*Використовуючи IntelliJ IDEA, створіть клас Arithmetic Average. Обчисліть середнє арифметичне трьох цілих значень і виведіть його на екран.
З якою проблемою ви зіткнулися? Який тип змінних краще використовуватиме коректне відображення результату?*/

public class HW5_Arithmetic_Average {
    public static void main(String[] args) {
        int x = 4;
        int y = 13;
        int z = 21;
        double result = (x + y + z) / 3.0;
        System.out.println("Arithmetic Average: " + result);
    }

    /*Зіткнувся з проблемою зі знаходження сер.ариф трьох цілих чисел. Оскільки їх середнє арифметичне
    не завжди буде цілим числом. Для виправлення цього моменту і коректного відображення результати слід
    використовувати тип float або double(більш точніший).*/
}