CREATE DATABASE MyDB;

USE MyDB;

CREATE TABLE Employees (
  employee_id INT AUTO_INCREMENT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  phone_number VARCHAR(15)
);

CREATE TABLE SalaryAndPosition (
  salary_id INT AUTO_INCREMENT PRIMARY KEY,
  employee_id INT,
  salary_amount DECIMAL(10, 2),
  position VARCHAR(50),
  FOREIGN KEY (employee_id) REFERENCES Employees(employee_id)
);

CREATE TABLE PersonalInfo (
  info_id INT AUTO_INCREMENT PRIMARY KEY,
  employee_id INT,
  marital_status VARCHAR(20),
  date_of_birth DATE,
  address VARCHAR(100),
  FOREIGN KEY (employee_id) REFERENCES Employees(employee_id)
);

INSERT INTO Employees (first_name, last_name, phone_number)
VALUES
  ('Іван', 'Петров', '+380951234567'),
  ('Марія', 'Сидорова', '+380992345678'),
  ('Петро', 'Іванов', '+380673456789'),
  ('Олена', 'Мороз', '+380504567890'),
  ('Сергій', 'Коваль', '+380993456789'),
  ('Наталія', 'Шевченко', '+380972345678'),
  ('Михайло', 'Савчук', '+380502345678'),
  ('Людмила', 'Петренко', '+380671234567'),
  ('Віталій', 'Козак', '+380932345678'),
  ('Тетяна', 'Лисенко', '+380992345678'),
  ('Роман', 'Бондаренко', '+380992345678'),
  ('Анастасія', 'Руденко', '+380672345678'),
  ('Ігор', 'Мельник', '+380504567890'),
  ('Ольга', 'Грищенко', '+380992345678'),
  ('Василь', 'Павлюк', '+380952345678'),
  ('Юлія', 'Кравченко', '+380501234567'),
  ('Олександр', 'Самойленко', '+380673456789'),
  ('Світлана', 'Коваленко', '+380672345678'),
  ('Артем', 'Ткачук', '+380992345678'),
  ('Алла', 'Рибак', '+380952345678');

INSERT INTO SalaryAndPosition (employee_id, salary_amount, position)
VALUES
  (1, 50000.00, 'Менеджер'),
  (2, 60000.00, 'Інженер'),
  (3, 45000.00, 'Програміст'),
  (4, 55000.00, 'Аналітик'),
  (5, 52000.00, 'Технік'),
  (6, 9999.00, 'Дизайнер'),
  (7, 48000.00, 'Маркетолог'),
  (8, 53000.00, 'Бухгалтер'),
  (9, 60000.00, 'Менеджер'),
  (10, 48000.00, 'Інженер'),
  (11, 62000.00, 'Програміст'),
  (12, 52000.00, 'Аналітик'),
  (13, 55000.00, 'Технік'),
  (14, 9000.00, 'Дизайнер'),
  (15, 48000.00, 'Маркетолог'),
  (16, 53000.00, 'Бухгалтер'),
  (17, 60000.00, 'Менеджер'),
  (18, 48000.00, 'Інженер'),
  (19, 62000.00, 'Програміст'),
  (20, 52000.00, 'Аналітик');

INSERT INTO PersonalInfo (employee_id, marital_status, date_of_birth, address)
VALUES
  (1, 'Холостий', '1980-05-15', 'м. Київ, вул. Центральна, 10'),
  (2, 'Заміжня', '1985-09-25', 'м. Львів, вул. Пушкіна, 5'),
  (3, 'Холостий', '1992-11-10', 'м. Харків, вул. Сов, 20'),
  (4, 'Одружений', '1978-12-03', 'м. Київ, вул. Незалежності, 25'),
  (5, 'Холостий', '1990-07-18', 'м. Львів, вул. Грушевського, 15'),
  (6, 'Заміжня', '1982-04-20', 'м. Харків, вул. Шевченка, 8'),
  (7, 'Одружений', '1987-09-02', 'м. Одеса, вул. Приморська, 30'),
  (8, 'Холостий', '1993-01-08', 'м. Київ, вул. Лесі Українки, 12'),
  (9, 'Заміжня', '1981-06-14', 'м. Львів, вул. Гагаріна, 5'),
  (10, 'Одружений', '1989-02-28', 'м. Одеса, вул. Дерибасівська, 18'),
  (11, 'Холостий', '1991-10-22', 'м. Харків, вул. Сумська, 45'),
  (12, 'Заміжня', '1979-03-07', 'м. Київ, вул. Володимирська, 40'),
  (13, 'Одружений', '1986-08-12', 'м. Львів, вул. Шота Руставелі, 60'),
  (14, 'Холостий', '1995-05-29', 'м. Харків, вул. Луніна, 70'),
  (15, 'Заміжня', '1983-11-17', 'м. Одеса, вул. Французький бульвар, 33'),
  (16, 'Одружений', '1994-07-23', 'м. Київ, вул. Івана Франка, 28'),
  (17, 'Холостий', '1990-04-11', 'м. Львів, вул. Саксаганського, 22'),
  (18, 'Заміжня', '1988-12-09', 'м. Одеса, вул. Буніна, 17'),
  (19, 'Одружений', '1984-03-05', 'м. Харків, вул. Мироносицька, 12'),
  (20, 'Холостий', '1996-08-27', 'м. Київ, вул. Андріївська, 8');
